# DeleteElements Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DeleteElements Class
Members See Also
---
Deletes element(s) related to the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class DeleteElements : FailureResolution
```

Visual Basic
---
```text
Public Class DeleteElements _
	Inherits FailureResolution
```

Visual C++
---
```text
public ref class DeleteElements : public FailureResolution
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FailureResolution Autodesk.Revit.DB..::..DeleteElements
# See Also
DeleteElements Members
Autodesk.Revit.DB Namespace